cask_args appdir: "~/Applications", require_sha: false, no_quarantine: true

tap "koekeishiya/formulae"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "eddieantonio/eddieantonio"
tap "buo/cask-upgrade"

cask "dotnet"
cask "tg-pro"
cask "neovide"
cask "firefox"
cask "google-chrome"
cask "discord"
cask "audacity"
cask "spotify"
cask "vscodium"
cask "iterm2"
cask "steam"
cask "epic-games"
cask "osu"
cask "obs"
cask "mullvadvpn"
#cask "bitwarden"
cask "spaceid"
cask "aldente"
cask "optimus-player"
cask "discretescroll"
cask "cheatsheet"
cask "zoom"
cask "signal"
cask "telegram"
cask "tiled"
cask "unity-hub"
cask "prismlauncher"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "intellij-idea-ce"
cask "notion"
cask "blender"
cask "qbittorrent"
cask "font-fira-code-nerd-font"
cask "cinebench"
cask "geekbench"
cask "altserver"
cask "swiftdefaultappsprefpane"

brew "choose-gui"
brew "ghostscript"
brew "jq"
brew "wget"
brew "neofetch"
brew "neovim"
brew "stow"
brew "git"
brew "lsd"
brew "htop"
brew "direnv"
brew "yt-dlp"
brew "tmux"
brew "figlet"
brew "cmatrix"
brew "sl"
brew "zola"
brew "asciiquarium"
brew "lolcat"
brew "bat"
brew "nyancat"
brew "cowsay"
brew "pfetch"
brew "tree"
brew "tree-sitter"
brew "rustup-init"
brew "ripgrep"
brew "p7zip"
brew "zip"
brew "unzip"
brew "coreutils"
brew "node"
brew "npm"
brew "zsh"
brew "bash"
brew "fish"
brew "skhd"
brew "yabai"
brew "starship"
brew "openjdk@17"
brew "openjdk@11"
brew "openjdk"
brew 'mas'
brew "duti"
brew "poppler"
brew "ffmpeg"
brew "llvm"
brew "cmake"
brew "fd"
brew "gtk4"
brew "imgcat"
brew "stylua"
brew "prettier"
brew "pyvim"
brew "fzf"
brew "imagemagick"
brew "go"
brew "google-java-format"
brew "julia"
brew "php"
brew "composer"
brew "black"
brew "shfmt"
brew "luarocks"
brew "shellcheck"

mas 'Xcode', id: 497799835
mas 'Davinci Resolve', id: 571213070
