cask_args appdir: "~/Applications", require_sha: false, no_quarantine: true

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "xcodesorg/made"
tap "isacikgoz/taps"

brew "choose-gui"
brew "jq"
brew "wget"
brew "neofetch"
brew "stow"
brew "git"
brew "lsd"
brew "htop"
brew "direnv"
brew "yt-dlp"
brew "tmux"
brew "figlet"
brew "cmatrix"
brew "sl"
brew "zola"
brew "asciiquarium"
brew "lolcat"
brew "bat"
brew "nyancat"
brew "cowsay"
brew "pfetch"
brew "tree"
brew "tree-sitter"
brew "rustup-init"
brew "zld"
brew "ripgrep"
brew "p7zip"
brew "zip"
brew "unzip"
brew "node"
brew "npm"
brew "zsh"
brew "bash"
brew "fish"
brew "fisher"
brew "terminal-notifier"
brew "skhd"
brew "yabai"
brew "starship"
brew "openjdk@17"
brew "openjdk@11"
brew "openjdk"
brew 'mas'
brew "duti"
brew "poppler"
brew "ffmpeg"
brew "llvm"
brew "cmake"
brew "fd"
brew "fzf"
brew "imagemagick"
brew "go"
brew "php"
brew "shellcheck"
brew "ghostscript"
brew "pandoc"
brew "maven"
brew "gnu-sed"
brew "coreutils"
brew "shfmt"
brew "black"
brew "luarocks"
brew "stylua"
brew "prettier"
brew "clang-format"
brew "jdtls"
brew "lua-language-server"
brew "toilet"

brew "neovim"
brew "chafa"
brew "imagemagick"
brew "ffmpegthumbnailer"
brew "pdftoipe"

brew "lf"
brew "nnn"
brew "luajit"

brew "nsnake" # yes

brew "aria2"
brew "xcodes"
mas 'Davinci Resolve', id: 571213070

cask "dotnet"
cask "firefox"
cask "notion"
cask "blender"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "godot"
cask "altserver"
cask "tiled"
cask "scroll-reverser"
cask "alacritty"
cask "spotify"
cask "discord"
cask "whatsapp"
cask "optimus-player"
cask "iina"
cask "obs"
cask "qbittorrent"
cask "signal"
cask "telegram"
cask "prismlauncher"
cask "mullvadvpn"

cask "font-fira-code-nerd-font"
cask "spaceid"
cask "tg-pro"
cask "aldente"
